package GameApp;

import GameApp.rank.RankController;

import java.io.IOException;

public class TestRank {
    public static void main(String[] args) throws IOException {
        RankController rankController = new RankController();
//        for(int i = 0; i < 10; i++){
//            rankController.createRank("mok11" , 6 + i );
//        }
//                    rankController.createRank("mok11" , 12 );

        rankController.top20Rank();


    }
}


//유저점수 ==>> 9 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:49
//    유저점수 ==>> 10 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:49
//    유저점수 ==>> 11 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:49
//    유저점수 ==>> 12 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:49
//    유저점수 ==>> 13 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:49
//    유저점수 ==>> 14 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:49
//    유저점수 ==>> 15 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:49
//    유저점수 ==>> 8 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:54
//    유저점수 ==>> 9 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:54
//    유저점수 ==>> 10 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:54
//    유저점수 ==>> 11 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:54
//    유저점수 ==>> 12 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:54
//    유저점수 ==>> 13 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:54
//    유저점수 ==>> 14 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:54
//    유저점수 ==>> 15 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:54
//    유저점수 ==>> 8 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:56
//    유저점수 ==>> 10 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:56
//    유저점수 ==>> 12 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:56
//    유저점수 ==>> 14 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:56
//    유저정보 ==>>19 =======
//
//
//
//    유저점수 ==>> 8 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:49
//    유저점수 ==>> 9 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:49
//    유저점수 ==>> 10 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:49
//    유저점수 ==>> 11 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:49
//    유저점수 ==>> 12 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:49
//    유저점수 ==>> 13 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:49
//    유저점수 ==>> 14 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:49
//    유저점수 ==>> 15 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:49
//    유저점수 ==>> 8 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:54
//    유저점수 ==>> 9 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:54
//    유저점수 ==>> 10 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:54
//    유저점수 ==>> 11 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:54
//    유저점수 ==>> 12 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:54
//    유저점수 ==>> 13 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:54
//    유저점수 ==>> 14 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:54
//    유저점수 ==>> 15 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:54
//    유저점수 ==>> 8 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:56
//    유저점수 ==>> 10 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:56
//    유저점수 ==>> 12 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:56
//    유저점수 ==>> 14 | 아이디 ==>> mok11 | 생성된 날짜2024-07-19 16:00:56
//    유저정보 ==>>20 =======